# -*- coding: utf-8 -*-
"""
Тесты для проверки симплекс-метода (полная версия с двухфазным методом)

Запуск:
    python test_simplex.py

Покрываемые случаи:
    1. Простая максимизация (только <=)
    2. Простая минимизация (только <=)
    3. Задача с >= (требуется двухфазный метод)
    4. Задача с = (требуется двухфазный метод)
    5. Отрицательные правые части (автоматическая нормализация)
    6. Неограниченное решение (max)
    7. Несовместная система
    8. Альтернативный оптимум
    9. Вырожденная задача
    10. Задача с 3 переменными и смешанными ограничениями
"""

import sys
import os

# Добавляем путь к модулю, если нужно (зависит от структуры проекта)
# sys.path.insert(0, os.path.dirname(os.path.abspath(__file__)))

# Импортируем функцию решения (предполагаем, что она доступна)
# Если код выше лежит в файле direct_lp.py, то:
try:
    from direct_lp import simplex_method_full
except ImportError:
    print("Ошибка импорта: убедитесь, что функция simplex_method_full доступна")
    sys.exit(1)


def run_test(name, c, A, b, maximize, constraints):
    """Запуск одного теста и вывод результата"""
    print("\n" + "=" * 70)
    print(f"Тест: {name}")
    print("=" * 70)
    print(f"c = {c}")
    print(f"A = {A}")
    print(f"b = {b}")
    print(f"maximize = {maximize}")
    print(f"constraints = {constraints}")

    result = simplex_method_full(c, A, b, maximize, constraints)

    if result['success']:
        print("\n✅ РЕШЕНИЕ НАЙДЕНО")
        print(f"x = {result['solution']}")
        print(f"F = {result['value']}")
        print(f"Количество итераций: {result['total_iterations']}")
    else:
        print("\n❌ ОШИБКА")
        print(f"Сообщение: {result['error']}")

    # Краткий вывод шагов (опционально)
    # print("\nШаги решения:")
    # for step in result['steps']:
    #     print(f"  - {step['title']}")


def main():
    tests = []

    # ----------------------------------------------------------------------
    # 1. Простая максимизация (только <=)
    # ----------------------------------------------------------------------
    tests.append({
        'name': '1. Простая максимизация (только <=)',
        'c': [2, 3],
        'A': [[1, 1],
              [2, 1]],
        'b': [4, 6],
        'maximize': True,
        'constraints': ['<=', '<='],
        'expected': {'solution': [2, 2], 'value': 10.0}
    })

    # ----------------------------------------------------------------------
    # 2. Простая минимизация (только <=)
    # ----------------------------------------------------------------------
    tests.append({
        'name': '2. Простая минимизация (только <=)',
        'c': [4, 5],
        'A': [[1, 2],
              [3, 2]],
        'b': [8, 12],
        'maximize': False,
        'constraints': ['<=', '<='],
        'expected': {'solution': [0, 0], 'value': 0.0}  # при x>=0
    })

    # ----------------------------------------------------------------------
    # 3. Задача с >= (двухфазный метод)
    # ----------------------------------------------------------------------
    tests.append({
        'name': '3. Задача с ограничением >=',
        'c': [3, 2],
        'A': [[2, 1],
              [1, 1]],
        'b': [6, 4],
        'maximize': True,
        'constraints': ['<=', '>='],
        'expected': {'solution': [2, 2], 'value': 10.0}  # (2,2) F=10
    })

    # ----------------------------------------------------------------------
    # 4. Задача с равенством (=)
    # ----------------------------------------------------------------------
    tests.append({
        'name': '4. Задача с равенством (=)',
        'c': [1, 1],
        'A': [[1, 2],
              [1, 1]],
        'b': [6, 4],
        'maximize': True,
        'constraints': ['<=', '='],
        'expected': {'solution': [2, 2], 'value': 4.0}
    })

    # ----------------------------------------------------------------------
    # 5. Отрицательные правые части (нормализация)
    # ----------------------------------------------------------------------
    tests.append({
        'name': '5. Отрицательные правые части (нормализация)',
        'c': [1, 2],
        'A': [[-1, 1],
              [1, -2]],
        'b': [-2, -4],
        'maximize': True,
        'constraints': ['<=', '<='],
        'expected': {'solution': [4, 2], 'value': 8.0}
        # Исходно: -x1 + x2 <= -2  => x1 - x2 >= 2
        #          x1 - 2x2 <= -4 => -x1 + 2x2 >= 4
        # Решение: x1=4, x2=2, F=1*4+2*2=8
    })

    # ----------------------------------------------------------------------
    # 6. Неограниченное решение (максимизация)
    # ----------------------------------------------------------------------
    tests.append({
        'name': '6. Неограниченная задача (F -> +inf)',
        'c': [1, 1],
        'A': [[-1, 1],
              [1, -1]],
        'b': [2, 1],
        'maximize': True,
        'constraints': ['<=', '<='],
        'expected': {'error': 'Целевая функция не ограничена'}
    })

    # ----------------------------------------------------------------------
    # 7. Несовместная система
    # ----------------------------------------------------------------------
    tests.append({
        'name': '7. Несовместная система',
        'c': [1, 1],
        'A': [[1, 1],
              [1, 1]],
        'b': [2, 5],
        'maximize': True,
        'constraints': ['<=', '>='],
        'expected': {'error': 'Система ограничений несовместна'}
    })

    # ----------------------------------------------------------------------
    # 8. Альтернативный оптимум
    # ----------------------------------------------------------------------
    tests.append({
        'name': '8. Альтернативный оптимум',
        'c': [1, 1],
        'A': [[1, 1],
              [1, 0],
              [0, 1]],
        'b': [5, 3, 4],
        'maximize': True,
        'constraints': ['<=', '<=', '<='],
        'expected': {'solution': [1, 4], 'value': 5.0}  # или [3,2]
    })

    # ----------------------------------------------------------------------
    # 9. Вырожденная задача
    # ----------------------------------------------------------------------
    tests.append({
        'name': '9. Вырожденная задача (b_i = 0)',
        'c': [2, 3],
        'A': [[1, 2],
              [1, 1],
              [1, 0]],
        'b': [4, 3, 1],
        'maximize': True,
        'constraints': ['<=', '<=', '<='],
        'expected': {'solution': [1, 1.5], 'value': 6.5}
    })

    # ----------------------------------------------------------------------
    # 10. Задача с 3 переменными и смешанными ограничениями
    # ----------------------------------------------------------------------
    tests.append({
        'name': '10. 3 переменные, смешанные ограничения',
        'c': [2, -1, 2],
        'A': [[1, 1, 0],
              [0, 1, 1],
              [1, 0, 1]],
        'b': [5, 8, 7],
        'maximize': True,
        'constraints': ['<=', '>=', '='],
        'expected': {'solution': [2, 3, 5], 'value': 11.0}
        # Решение (2,3,5): 2*2 -1*3 +2*5 = 4-3+10=11
    })

    # ----------------------------------------------------------------------
    # Запуск всех тестов
    # ----------------------------------------------------------------------
    passed = 0
    failed = 0

    for test in tests:
        run_test(
            name=test['name'],
            c=test['c'],
            A=test['A'],
            b=test['b'],
            maximize=test['maximize'],
            constraints=test['constraints']
        )

      

    print("\n" + "=" * 70)
    print("Тестирование завершено.")
    print("=" * 70)


if __name__ == "__main__":
    main()
